espressif/esp-idf/components/soc/esp32p4/include/soc/lp_gpio_struct.h
/**
 * SPDX-FileCopyrightText: 2023 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0
 */
#pragma once

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/** Group: clk_en */
/** Type of clk_en register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_clk_en : R/W; bitpos: [0]; default: 1;
         *  Reserved
         */
        uint32_t reg_clk_en:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} lp_gpio_clk_en_reg_t;


/** Group: ver_date */
/** Type of ver_date register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_ver_date : R/W; bitpos: [27:0]; default: 2294563;
         *  Reserved
         */
        uint32_t reg_ver_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} lp_gpio_ver_date_reg_t;


/** Group: out */
/** Type of out register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_out_data : R/W/WTC; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_out_data:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_out_reg_t;


/** Group: out_w1ts */
/** Type of out_w1ts register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_out_data_w1ts : WT; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_out_data_w1ts:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_out_w1ts_reg_t;


/** Group: out_w1tc */
/** Type of out_w1tc register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_out_data_w1tc : WT; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_out_data_w1tc:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_out_w1tc_reg_t;


/** Group: enable */
/** Type of enable register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_enable_data : R/W/WTC; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_enable_data:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_enable_reg_t;


/** Group: enable_w1ts */
/** Type of enable_w1ts register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_enable_data_w1ts : WT; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_enable_data_w1ts:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_enable_w1ts_reg_t;


/** Group: enable_w1tc */
/** Type of enable_w1tc register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_enable_data_w1tc : WT; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_enable_data_w1tc:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_enable_w1tc_reg_t;


/** Group: status */
/** Type of status register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_status_data : R/W/WTC; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_status_data:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_status_reg_t;


/** Group: status_w1ts */
/** Type of status_w1ts register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_status_data_w1ts : WT; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_status_data_w1ts:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_status_w1ts_reg_t;


/** Group: status_w1tc */
/** Type of status_w1tc register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_status_data_w1tc : WT; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_status_data_w1tc:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_status_w1tc_reg_t;


/** Group: in */
/** Type of status_next register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_status_interrupt_next : RO; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_status_interrupt_next:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_status_next_reg_t;

/** Type of in register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_in_data_next : RO; bitpos: [15:0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_in_data_next:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} lp_gpio_in_reg_t;


/** Group: pin0 */
/** Type of pin0 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin0_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin0_wakeup_enable:1;
        /** reg_gpio_pin0_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin0_int_type:3;
        /** reg_gpio_pin0_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin0_pad_driver:1;
        /** reg_gpio_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpio_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin0_reg_t;


/** Group: pin1 */
/** Type of pin1 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin1_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin1_wakeup_enable:1;
        /** reg_gpio_pin1_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin1_int_type:3;
        /** reg_gpio_pin1_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin1_pad_driver:1;
        /** reg_gpi1_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi1_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin1_reg_t;


/** Group: pin2 */
/** Type of pin2 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin2_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin2_wakeup_enable:1;
        /** reg_gpio_pin2_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin2_int_type:3;
        /** reg_gpio_pin2_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin2_pad_driver:1;
        /** reg_gpi2_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi2_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin2_reg_t;


/** Group: pin3 */
/** Type of pin3 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin3_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin3_wakeup_enable:1;
        /** reg_gpio_pin3_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin3_int_type:3;
        /** reg_gpio_pin3_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin3_pad_driver:1;
        /** reg_gpi3_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi3_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin3_reg_t;


/** Group: pin4 */
/** Type of pin4 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin4_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin4_wakeup_enable:1;
        /** reg_gpio_pin4_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin4_int_type:3;
        /** reg_gpio_pin4_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin4_pad_driver:1;
        /** reg_gpi4_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi4_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin4_reg_t;


/** Group: pin5 */
/** Type of pin5 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin5_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin5_wakeup_enable:1;
        /** reg_gpio_pin5_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin5_int_type:3;
        /** reg_gpio_pin5_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin5_pad_driver:1;
        /** reg_gpi5_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi5_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin5_reg_t;


