espressif/esp-idf/components/soc/esp32p4/include/soc/lp_gpio_struct.h
/** Group: pin6 */
/** Type of pin6 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin6_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin6_wakeup_enable:1;
        /** reg_gpio_pin6_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin6_int_type:3;
        /** reg_gpio_pin6_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin6_pad_driver:1;
        /** reg_gpi6_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi6_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin6_reg_t;


/** Group: pin7 */
/** Type of pin7 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin7_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin7_wakeup_enable:1;
        /** reg_gpio_pin7_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin7_int_type:3;
        /** reg_gpio_pin7_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin7_pad_driver:1;
        /** reg_gpi7_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi7_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin7_reg_t;


/** Group: pin8 */
/** Type of pin8 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin8_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin8_wakeup_enable:1;
        /** reg_gpio_pin8_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin8_int_type:3;
        /** reg_gpio_pin8_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin8_pad_driver:1;
        /** reg_gpi8_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi8_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin8_reg_t;


/** Group: pin9 */
/** Type of pin9 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin9_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin9_wakeup_enable:1;
        /** reg_gpio_pin9_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin9_int_type:3;
        /** reg_gpio_pin9_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin9_pad_driver:1;
        /** reg_gpi9_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi9_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin9_reg_t;


/** Group: pin10 */
/** Type of pin10 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin10_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin10_wakeup_enable:1;
        /** reg_gpio_pin10_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin10_int_type:3;
        /** reg_gpio_pin10_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin10_pad_driver:1;
        /** reg_gpi10_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi10_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin10_reg_t;


/** Group: pin11 */
/** Type of pin11 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin11_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin11_wakeup_enable:1;
        /** reg_gpio_pin11_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin11_int_type:3;
        /** reg_gpio_pin11_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin11_pad_driver:1;
        /** reg_gpi11_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi11_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin11_reg_t;


/** Group: pin12 */
/** Type of pin12 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin12_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin12_wakeup_enable:1;
        /** reg_gpio_pin12_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin12_int_type:3;
        /** reg_gpio_pin12_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin12_pad_driver:1;
        /** reg_gpi12_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi12_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin12_reg_t;


/** Group: pin13 */
/** Type of pin13 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin13_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin13_wakeup_enable:1;
        /** reg_gpio_pin13_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin13_int_type:3;
        /** reg_gpio_pin13_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin13_pad_driver:1;
        /** reg_gpi13_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi13_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin13_reg_t;


