espressif/esp-idf/components/soc/esp32p4/include/soc/lp_gpio_struct.h
/** Group: pin14 */
/** Type of pin14 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin14_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin14_wakeup_enable:1;
        /** reg_gpio_pin14_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin14_int_type:3;
        /** reg_gpio_pin14_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin14_pad_driver:1;
        /** reg_gpi14_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi14_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin14_reg_t;


/** Group: pin15 */
/** Type of pin15 register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_pin15_wakeup_enable : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin15_wakeup_enable:1;
        /** reg_gpio_pin15_int_type : R/W; bitpos: [3:1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin15_int_type:3;
        /** reg_gpio_pin15_pad_driver : R/W; bitpos: [4]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_pin15_pad_driver:1;
        /** reg_gpi15_pin0_edge_wakeup_clr : WT; bitpos: [5]; default: 0;
         *  need des
         */
        uint32_t reg_gpi15_pin0_edge_wakeup_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} lp_gpio_pin15_reg_t;


/** Group: func0_in_sel_cfg */
/** Type of func0_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func0_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func0_in_inv_sel:1;
        /** reg_gpio_sig0_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig0_in_sel:1;
        /** reg_gpio_func0_in_sel : R/W; bitpos: [7:2]; default: 48;
         *  reg_gpio_func0_in_sel[5:4]==2'b11->constant
         *  1,reg_gpio_func0_in_sel[5:4]==2'b10->constant 0
         */
        uint32_t reg_gpio_func0_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func0_in_sel_cfg_reg_t;


/** Group: func1_in_sel_cfg */
/** Type of func1_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func1_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func1_in_inv_sel:1;
        /** reg_gpio_sig1_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig1_in_sel:1;
        /** reg_gpio_func1_in_sel : R/W; bitpos: [7:2]; default: 48;
         *  Reserved
         */
        uint32_t reg_gpio_func1_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func1_in_sel_cfg_reg_t;


/** Group: func2_in_sel_cfg */
/** Type of func2_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func2_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func2_in_inv_sel:1;
        /** reg_gpio_sig2_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig2_in_sel:1;
        /** reg_gpio_func2_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func2_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func2_in_sel_cfg_reg_t;


/** Group: func3_in_sel_cfg */
/** Type of func3_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func3_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func3_in_inv_sel:1;
        /** reg_gpio_sig3_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig3_in_sel:1;
        /** reg_gpio_func3_in_sel : R/W; bitpos: [7:2]; default: 48;
         *  Reserved
         */
        uint32_t reg_gpio_func3_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func3_in_sel_cfg_reg_t;


/** Group: func4_in_sel_cfg */
/** Type of func4_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func4_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func4_in_inv_sel:1;
        /** reg_gpio_sig4_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig4_in_sel:1;
        /** reg_gpio_func4_in_sel : R/W; bitpos: [7:2]; default: 48;
         *  Reserved
         */
        uint32_t reg_gpio_func4_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func4_in_sel_cfg_reg_t;


/** Group: func5_in_sel_cfg */
/** Type of func5_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func5_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func5_in_inv_sel:1;
        /** reg_gpio_sig5_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig5_in_sel:1;
        /** reg_gpio_func5_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func5_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func5_in_sel_cfg_reg_t;


/** Group: func6_in_sel_cfg */
/** Type of func6_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func6_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func6_in_inv_sel:1;
        /** reg_gpio_sig6_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig6_in_sel:1;
        /** reg_gpio_func6_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func6_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func6_in_sel_cfg_reg_t;


/** Group: func7_in_sel_cfg */
/** Type of func7_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func7_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func7_in_inv_sel:1;
        /** reg_gpio_sig7_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig7_in_sel:1;
        /** reg_gpio_func7_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func7_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func7_in_sel_cfg_reg_t;


