espressif/esp-idf/components/soc/esp32p4/include/soc/lp_gpio_struct.h
/** Group: func8_in_sel_cfg */
/** Type of func8_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func8_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func8_in_inv_sel:1;
        /** reg_gpio_sig8_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig8_in_sel:1;
        /** reg_gpio_func8_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func8_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func8_in_sel_cfg_reg_t;


/** Group: func9_in_sel_cfg */
/** Type of func9_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func9_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func9_in_inv_sel:1;
        /** reg_gpio_sig9_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig9_in_sel:1;
        /** reg_gpio_func9_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func9_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func9_in_sel_cfg_reg_t;


/** Group: func10_in_sel_cfg */
/** Type of func10_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func10_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func10_in_inv_sel:1;
        /** reg_gpio_sig10_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig10_in_sel:1;
        /** reg_gpio_func10_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func10_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func10_in_sel_cfg_reg_t;


/** Group: func11_in_sel_cfg */
/** Type of func11_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func11_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func11_in_inv_sel:1;
        /** reg_gpio_sig11_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig11_in_sel:1;
        /** reg_gpio_func11_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func11_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func11_in_sel_cfg_reg_t;


/** Group: func12_in_sel_cfg */
/** Type of func12_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func12_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func12_in_inv_sel:1;
        /** reg_gpio_sig12_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig12_in_sel:1;
        /** reg_gpio_func12_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func12_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func12_in_sel_cfg_reg_t;


/** Group: func13_in_sel_cfg */
/** Type of func13_in_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func13_in_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func13_in_inv_sel:1;
        /** reg_gpio_sig13_in_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_sig13_in_sel:1;
        /** reg_gpio_func13_in_sel : R/W; bitpos: [7:2]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func13_in_sel:6;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} lp_gpio_func13_in_sel_cfg_reg_t;


/** Group: func0_out_sel_cfg */
/** Type of func0_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func0_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func0_oe_inv_sel:1;
        /** reg_gpio_func0_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func0_oe_sel:1;
        /** reg_gpio_func0_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func0_out_inv_sel:1;
        /** reg_gpio_func0_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  reg_gpio_func0_out_sel[5:1]==16 -> output gpio register value to pad
         */
        uint32_t reg_gpio_func0_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func0_out_sel_cfg_reg_t;


/** Group: func1_out_sel_cfg */
/** Type of func1_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func1_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func1_oe_inv_sel:1;
        /** reg_gpio_func1_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func1_oe_sel:1;
        /** reg_gpio_func1_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func1_out_inv_sel:1;
        /** reg_gpio_func1_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func1_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func1_out_sel_cfg_reg_t;


/** Group: func2_out_sel_cfg */
/** Type of func2_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func2_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func2_oe_inv_sel:1;
        /** reg_gpio_func2_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func2_oe_sel:1;
        /** reg_gpio_func2_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func2_out_inv_sel:1;
        /** reg_gpio_func2_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func2_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func2_out_sel_cfg_reg_t;


/** Group: func3_out_sel_cfg */
/** Type of func3_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func3_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func3_oe_inv_sel:1;
        /** reg_gpio_func3_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func3_oe_sel:1;
        /** reg_gpio_func3_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func3_out_inv_sel:1;
        /** reg_gpio_func3_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func3_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func3_out_sel_cfg_reg_t;


/** Group: func4_out_sel_cfg */
/** Type of func4_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func4_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func4_oe_inv_sel:1;
        /** reg_gpio_func4_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func4_oe_sel:1;
        /** reg_gpio_func4_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func4_out_inv_sel:1;
        /** reg_gpio_func4_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func4_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func4_out_sel_cfg_reg_t;


/** Group: func5_out_sel_cfg */
/** Type of func5_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func5_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func5_oe_inv_sel:1;
        /** reg_gpio_func5_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func5_oe_sel:1;
        /** reg_gpio_func5_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func5_out_inv_sel:1;
        /** reg_gpio_func5_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func5_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func5_out_sel_cfg_reg_t;


