espressif/esp-idf/components/soc/esp32p4/include/soc/lp_gpio_struct.h
/** Group: func6_out_sel_cfg */
/** Type of func6_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func6_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func6_oe_inv_sel:1;
        /** reg_gpio_func6_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func6_oe_sel:1;
        /** reg_gpio_func6_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func6_out_inv_sel:1;
        /** reg_gpio_func6_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func6_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func6_out_sel_cfg_reg_t;


/** Group: func7_out_sel_cfg */
/** Type of func7_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func7_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func7_oe_inv_sel:1;
        /** reg_gpio_func7_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func7_oe_sel:1;
        /** reg_gpio_func7_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func7_out_inv_sel:1;
        /** reg_gpio_func7_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func7_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func7_out_sel_cfg_reg_t;


/** Group: func8_out_sel_cfg */
/** Type of func8_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func8_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func8_oe_inv_sel:1;
        /** reg_gpio_func8_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func8_oe_sel:1;
        /** reg_gpio_func8_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func8_out_inv_sel:1;
        /** reg_gpio_func8_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func8_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func8_out_sel_cfg_reg_t;


/** Group: func9_out_sel_cfg */
/** Type of func9_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func9_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func9_oe_inv_sel:1;
        /** reg_gpio_func9_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func9_oe_sel:1;
        /** reg_gpio_func9_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func9_out_inv_sel:1;
        /** reg_gpio_func9_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func9_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func9_out_sel_cfg_reg_t;


/** Group: func10_out_sel_cfg */
/** Type of func10_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func10_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func10_oe_inv_sel:1;
        /** reg_gpio_func10_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func10_oe_sel:1;
        /** reg_gpio_func10_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func10_out_inv_sel:1;
        /** reg_gpio_func10_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func10_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func10_out_sel_cfg_reg_t;


/** Group: func11_out_sel_cfg */
/** Type of func11_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func11_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func11_oe_inv_sel:1;
        /** reg_gpio_func11_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func11_oe_sel:1;
        /** reg_gpio_func11_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func11_out_inv_sel:1;
        /** reg_gpio_func11_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func11_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func11_out_sel_cfg_reg_t;


/** Group: func12_out_sel_cfg */
/** Type of func12_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func12_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func12_oe_inv_sel:1;
        /** reg_gpio_func12_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func12_oe_sel:1;
        /** reg_gpio_func12_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func12_out_inv_sel:1;
        /** reg_gpio_func12_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func12_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func12_out_sel_cfg_reg_t;


/** Group: func13_out_sel_cfg */
/** Type of func13_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func13_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func13_oe_inv_sel:1;
        /** reg_gpio_func13_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func13_oe_sel:1;
        /** reg_gpio_func13_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func13_out_inv_sel:1;
        /** reg_gpio_func13_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func13_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func13_out_sel_cfg_reg_t;


/** Group: func14_out_sel_cfg */
/** Type of func14_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func14_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func14_oe_inv_sel:1;
        /** reg_gpio_func14_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func14_oe_sel:1;
        /** reg_gpio_func14_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func14_out_inv_sel:1;
        /** reg_gpio_func14_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func14_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func14_out_sel_cfg_reg_t;


/** Group: func15_out_sel_cfg */
/** Type of func15_out_sel_cfg register
 *  Reserved
 */
typedef union {
    struct {
        /** reg_gpio_func15_oe_inv_sel : R/W; bitpos: [0]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func15_oe_inv_sel:1;
        /** reg_gpio_func15_oe_sel : R/W; bitpos: [1]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func15_oe_sel:1;
        /** reg_gpio_func15_out_inv_sel : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t reg_gpio_func15_out_inv_sel:1;
        /** reg_gpio_func15_out_sel : R/W; bitpos: [8:3]; default: 32;
         *  Reserved
         */
        uint32_t reg_gpio_func15_out_sel:6;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} lp_gpio_func15_out_sel_cfg_reg_t;


