espressif/esp-idf/components/soc/esp32p4/include/soc/lp_gpio_struct.h
typedef struct {
    volatile lp_gpio_clk_en_reg_t clk_en;
    volatile lp_gpio_ver_date_reg_t ver_date;
    volatile lp_gpio_out_reg_t out;
    volatile lp_gpio_out_w1ts_reg_t out_w1ts;
    volatile lp_gpio_out_w1tc_reg_t out_w1tc;
    volatile lp_gpio_enable_reg_t enable;
    volatile lp_gpio_enable_w1ts_reg_t enable_w1ts;
    volatile lp_gpio_enable_w1tc_reg_t enable_w1tc;
    volatile lp_gpio_status_reg_t status;
    volatile lp_gpio_status_w1ts_reg_t status_w1ts;
    volatile lp_gpio_status_w1tc_reg_t status_w1tc;
    volatile lp_gpio_status_next_reg_t status_next;
    volatile lp_gpio_in_reg_t in;
    volatile lp_gpio_pin0_reg_t pin0;
    volatile lp_gpio_pin1_reg_t pin1;
    volatile lp_gpio_pin2_reg_t pin2;
    volatile lp_gpio_pin3_reg_t pin3;
    volatile lp_gpio_pin4_reg_t pin4;
    volatile lp_gpio_pin5_reg_t pin5;
    volatile lp_gpio_pin6_reg_t pin6;
    volatile lp_gpio_pin7_reg_t pin7;
    volatile lp_gpio_pin8_reg_t pin8;
    volatile lp_gpio_pin9_reg_t pin9;
    volatile lp_gpio_pin10_reg_t pin10;
    volatile lp_gpio_pin11_reg_t pin11;
    volatile lp_gpio_pin12_reg_t pin12;
    volatile lp_gpio_pin13_reg_t pin13;
    volatile lp_gpio_pin14_reg_t pin14;
    volatile lp_gpio_pin15_reg_t pin15;
    volatile lp_gpio_func0_in_sel_cfg_reg_t func0_in_sel_cfg;
    volatile lp_gpio_func1_in_sel_cfg_reg_t func1_in_sel_cfg;
    volatile lp_gpio_func2_in_sel_cfg_reg_t func2_in_sel_cfg;
    volatile lp_gpio_func3_in_sel_cfg_reg_t func3_in_sel_cfg;
    volatile lp_gpio_func4_in_sel_cfg_reg_t func4_in_sel_cfg;
    volatile lp_gpio_func5_in_sel_cfg_reg_t func5_in_sel_cfg;
    volatile lp_gpio_func6_in_sel_cfg_reg_t func6_in_sel_cfg;
    volatile lp_gpio_func7_in_sel_cfg_reg_t func7_in_sel_cfg;
    volatile lp_gpio_func8_in_sel_cfg_reg_t func8_in_sel_cfg;
    volatile lp_gpio_func9_in_sel_cfg_reg_t func9_in_sel_cfg;
    volatile lp_gpio_func10_in_sel_cfg_reg_t func10_in_sel_cfg;
    volatile lp_gpio_func11_in_sel_cfg_reg_t func11_in_sel_cfg;
    volatile lp_gpio_func12_in_sel_cfg_reg_t func12_in_sel_cfg;
    volatile lp_gpio_func13_in_sel_cfg_reg_t func13_in_sel_cfg;
    uint32_t reserved_0ac[18];
    volatile lp_gpio_func0_out_sel_cfg_reg_t func0_out_sel_cfg;
    volatile lp_gpio_func1_out_sel_cfg_reg_t func1_out_sel_cfg;
    volatile lp_gpio_func2_out_sel_cfg_reg_t func2_out_sel_cfg;
    volatile lp_gpio_func3_out_sel_cfg_reg_t func3_out_sel_cfg;
    volatile lp_gpio_func4_out_sel_cfg_reg_t func4_out_sel_cfg;
    volatile lp_gpio_func5_out_sel_cfg_reg_t func5_out_sel_cfg;
    volatile lp_gpio_func6_out_sel_cfg_reg_t func6_out_sel_cfg;
    volatile lp_gpio_func7_out_sel_cfg_reg_t func7_out_sel_cfg;
    volatile lp_gpio_func8_out_sel_cfg_reg_t func8_out_sel_cfg;
    volatile lp_gpio_func9_out_sel_cfg_reg_t func9_out_sel_cfg;
    volatile lp_gpio_func10_out_sel_cfg_reg_t func10_out_sel_cfg;
    volatile lp_gpio_func11_out_sel_cfg_reg_t func11_out_sel_cfg;
    volatile lp_gpio_func12_out_sel_cfg_reg_t func12_out_sel_cfg;
    volatile lp_gpio_func13_out_sel_cfg_reg_t func13_out_sel_cfg;
    volatile lp_gpio_func14_out_sel_cfg_reg_t func14_out_sel_cfg;
    volatile lp_gpio_func15_out_sel_cfg_reg_t func15_out_sel_cfg;
} lp_gpio_dev_t;


#ifndef __cplusplus
_Static_assert(sizeof(lp_gpio_dev_t) == 0x134, "Invalid size of lp_gpio_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
